{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 768,
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    64,
    128,
    320,
    512
  ],
  "id2label": {
    "0": "Road",
    "1": "Sidewalk",
    "2": "Curb",
    "3": "Lane Marking",
    "4": "Crosswalk",
    "5": "Barrier",
    "6": "Bridge",
    "7": "Tunnel",
    "8": "Building",
    "9": "Vegetation/Terrain",
    "10": "Traffic Control",
    "11": "Pole/Light",
    "12": "Person",
    "13": "Two-wheeler",
    "14": "Vehicle",
    "15": "Pothole"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Barrier": 5,
    "Bridge": 6,
    "Building": 8,
    "Crosswalk": 4,
    "Curb": 2,
    "Lane Marking": 3,
    "Person": 12,
    "Pole/Light": 11,
    "Pothole": 15,
    "Road": 0,
    "Sidewalk": 1,
    "Traffic Control": 10,
    "Tunnel": 7,
    "Two-wheeler": 13,
    "Vegetation/Terrain": 9,
    "Vehicle": 14
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "5.0.0"
}
